abagofbread/defcon-34-eink-tags/Tag_FW_EFR32xG22/firmware/oepl_app.c
// -----------------------------------------------------------------------------
//                                   Includes
// -----------------------------------------------------------------------------
#include "oepl_app.h"
#include "oepl_radio.h"
#include "oepl_hw_abstraction.h"
#include "oepl_nvm.h"
#include "oepl_led.h"
#include "oepl_display.h"
#include "oepl_provision.h"
#include "oepl_pinprov_debug.h"
#include "oepl_fw_identity.h"
#include "oepl_button.h"
#include "md5.h"

#include <stdio.h>
#include <stddef.h>
#include <string.h>

#include "em_device.h"

// -----------------------------------------------------------------------------
//                              Configuration values
// -----------------------------------------------------------------------------
#ifndef APP_DEBUG_PRINT
#define APP_DEBUG_PRINT 1
#endif

#define EVENT_FLAG_BUTTON_1     (1 << 0)
#define EVENT_FLAG_BUTTON_2     (1 << 1)
#define EVENT_FLAG_GPIO         (1 << 2)
#define EVENT_FLAG_NFC_WAKE     (1 << 3)
#define EVENT_FLAG_CONNECTED    (1 << 4)
#define EVENT_FLAG_DISCONNECTED (1 << 5)

// -----------------------------------------------------------------------------
//                              Macros and Typedefs
// -----------------------------------------------------------------------------
#if APP_DEBUG_PRINT
#define DPRINTF(...) oepl_hw_debugprint(DBG_APP, __VA_ARGS__)
#else
#define DPRINTF(...)
#endif

// Todo: propagate these into shared OEPL definitions
#define IMG_EXTTYPE_PRELOAD_FLAG 0x04
#define IMG_EXTTYPE_LUT_MASK 0x03
#define IMG_EXTTYPE_IMGID_MASK 0xF8
#define IMG_EXTTYPE_IMGID_SHIFT 0x03
#define IMG_EXTTYPE_IMGID_FROM_EXTTYPE( exttype ) ((uint8_t)((uint8_t)(exttype & IMG_EXTTYPE_IMGID_MASK) >> IMG_EXTTYPE_IMGID_SHIFT))

typedef enum {
  BOOT_FACTORY_FRESH,
  BOOT_POWERCYCLE,
  BOOT_UPGRADE
} boot_type_t;

typedef enum {
  MODE_NORMAL = 0,
  MODE_SLIDESHOW_FAST = 0x06,
  MODE_SLIDESHOW_MEDIUM = 0x07,
  MODE_SLIDESHOW_SLOW = 0x08,
  MODE_SLIDESHOW_GLACIAL = 0x09,
  MODE_WAIT_RFWAKE = 0x20
} application_mode_t;

typedef enum {
  BOOT,
  CONNECTED,
  DISCONNECTED,
  DATA_AVAILABLE,
  DOWNLOAD,
  AWAITING_CONFIRMATION,
  CONFIRMATION_RECEIVED
} application_state_t;

// -----------------------------------------------------------------------------
//                          Static Function Declarations
// -----------------------------------------------------------------------------
static oepl_radio_action_t radio_event_handler(oepl_radio_event_t event, const void* event_data);
static void application_state_transition(application_state_t new_state);
static void application_mode_transition(application_mode_t new_mode);
static void application_process_data(oepl_radio_data_indication_t* data);
static void application_process_datablock(oepl_radio_blockrecv_t* block);
static bool application_check_md5(const uint8_t* data, size_t bytes, const uint8_t* reference);
static bool application_is_locked_update(uint8_t dataType);
static oepl_nvm_status_t oepl_app_allocate_provision_slot(size_t* img_idx);
static void oepl_app_button_handler(oepl_hw_gpio_channel_t button, oepl_hw_gpio_event_t event);

// data processing handlers, could be moved into separate files for clarity
static bool application_process_image_block(size_t index, const uint8_t* data, size_t length, bool is_last);
static bool application_process_fwu_block(size_t index, const uint8_t* data, size_t length, bool is_last);
static bool application_process_config_block(size_t index, const uint8_t* data, size_t length, bool is_last);
static bool application_process_nfcu_block(size_t index, const uint8_t* data, size_t length, bool is_last);
static bool application_process_nfcr_block(size_t index, const uint8_t* data, size_t length, bool is_last);

// -----------------------------------------------------------------------------
//                                Global Variables
// -----------------------------------------------------------------------------

// -----------------------------------------------------------------------------
//                                Static Variables
// -----------------------------------------------------------------------------
static oepl_radio_data_indication_t data_to_process;
static oepl_datablock_descriptor_t datablock_in_progress;
static const uint8_t* datablock = NULL;

static application_state_t current_state = BOOT;
static bool stay_awake = false;

static volatile uint32_t event_flags = 0;
static volatile oepl_hw_gpio_event_t button1_event = RISING;
static volatile oepl_hw_gpio_event_t button2_event = RISING;

// -----------------------------------------------------------------------------
//                          Public Function Definitions
// -----------------------------------------------------------------------------
bool oepl_app_is_event_pending(void)
{
  return (event_flags != 0) || stay_awake;
}

void oepl_app_init(void)
{
  // Called once out of reset. Do all hardware setup, load all configuration
  // values.

  // Initialize the common hardware resources
  oepl_hw_init();
  oepl_fw_identity_print();

  // Check if an upgrade was applied, and if so, tell the FWU system to not
  // indicate this on next boot.
  bool was_upgraded = oepl_fwu_is_upgraded();
  if(was_upgraded) {
    DPRINTF("We were upgraded!\n");
    oepl_fwu_confirm_upgrade();
  }

  // Boot display: PIN UI if requested, otherwise kiosk user image or stock splash
  uint8_t fastboot;
  oepl_provision_init();
  oepl_button_init();
  if (oepl_provision_should_show_pin()) {
    oepl_provision_begin_pin_display();
  } else if(oepl_nvm_setting_get(OEPL_ENABLE_FASTBOOT, &fastboot, sizeof(fastboot)) == NVM_SUCCESS && fastboot != 0) {
    // Skip the boot screen
  } else {
    oepl_provision_show_user_image();
  }
  oepl_provision_handle_pending_display();

  // Check whether there is a stored channel
  uint32_t last_channel;
  oepl_nvm_status_t status = oepl_nvm_setting_get(OEPL_LAST_CONNECTED_CHANNEL, &last_channel, sizeof(last_channel));
  if(status != NVM_SUCCESS) {
    last_channel = 0;
  } else {
    DPRINTF("Have previously been connected on ch%ld\n", last_channel);
  }
  // Setup and start the radio
  oepl_radio_init(radio_event_handler, WAKEUP_REASON_FIRSTBOOT, last_channel);
  // Setup the external interrupts and callback
  oepl_hw_init_gpio(oepl_app_button_handler);
  return;
}

/**************************************************************************//**
 * This is the event loop function for the OEPL app implementation. Call it for
 * each iteration of the main event loop such that it can process events.
 *****************************************************************************/
void oepl_app_process(void)
{
  oepl_button_process();
  oepl_provision_process();

  // Service the radio first, since it may trigger one or more callbacks.
  if(oepl_radio_is_event_pending()) {
    oepl_radio_process();
  }

  // Application event loop
  switch(current_state) {
    case BOOT:
      // Nothing to see here, waiting for the radio process to tell us we're
      // either connected or orphaned
      break;
    case CONNECTED:
      // Nothing to see here, waiting for the radio process to tell us we've
      // got a pending action, or we've been disconnected due to the AP going
      // AWOL.
      break;
    case DATA_AVAILABLE:
      // Process the received data indication from the AP. This state will 
      // always trigger an immediate state transition to either a
      // downloading or (back to) connected state.
      if(application_is_locked_update(data_to_process.AP_data.dataType)) {
        DPRINTF("Remote updates locked, ignoring datatype 0x%02X\n", data_to_process.AP_data.dataType);
        application_state_transition(CONNECTED);
        break;
      }
      switch(data_to_process.AP_data.dataType) {
        case DATATYPE_NOUPDATE:
          DPRINTF("NOP indication shouldn't bubble up to app\n");
          application_state_transition(CONNECTED);
          break;
        case DATATYPE_IMG_RAW_1BPP:
          // Fallthrough
        case DATATYPE_IMG_RAW_2BPP:
          // Fallthrough
        case DATATYPE_IMG_ZLIB:
        {
          DPRINTF("Image indication received:\n");
          DPRINTF("  - Type %02x\n", data_to_process.AP_data.dataType);
          DPRINTF("  - ExtType %02x\n", data_to_process.AP_data.dataTypeArgument);
          DPRINTF("  - Size %ldB\n", data_to_process.AP_data.dataSize);
          DPRINTF("  - Checksum %08lx%08lx\n", (uint32_t)(data_to_process.AP_data.dataVer >> 32), (uint32_t)data_to_process.AP_data.dataVer);

          if (!oepl_provision_updates_allowed() || oepl_provision_is_active()) {
            char entered_pin[OEPL_PROVISION_PIN_LEN + 1];
            memcpy(entered_pin, data_to_process.AP_data.provisionPin, OEPL_PROVISION_PIN_LEN);
            entered_pin[OEPL_PROVISION_PIN_LEN] = '\0';
            if (!oepl_provision_authorize_session(entered_pin)) {
              PINPROV_DBG("H-A", "image_offer PIN_REJECT type=0x%02x", data_to_process.AP_data.dataType);
              DPRINTF("Image rejected: missing or wrong PIN\n");
              application_state_transition(CONNECTED);
              break;
            }
            PINPROV_DBG("H-A", "image_offer PIN_OK type=0x%02x sz=%lu",
                        data_to_process.AP_data.dataType,
                        (unsigned long)data_to_process.AP_data.dataSize);
          }

          if(data_to_process.AP_data.dataTypeArgument & IMG_EXTTYPE_LUT_MASK) {
            DPRINTF("Custom LUT support not implemented\n");
            // Don't download, skip to confirmation
            application_state_transition(AWAITING_CONFIRMATION);
            break;
          }

          oepl_stored_image_hdr_t img_meta;
          size_t img_idx;
          oepl_nvm_status_t nvm_status = oepl_nvm_get_image_by_hash(
            data_to_process.AP_data.dataVer, data_to_process.AP_data.dataSize,
            &img_idx, &img_meta);
          if(nvm_status == NVM_SUCCESS) {
            // if regular image, display from cache if it is complete
            if(img_meta.is_valid) {
              if(oepl_provision_is_session_authorized() || oepl_provision_is_active()) {
                PINPROV_DBG("H-C", "cache_bypass slot=%u", (unsigned)img_idx);
                DPRINTF("Provision session: force re-download (cache bypass)\n");
                oepl_nvm_erase_image(img_idx);
                img_meta.is_valid = false;
                img_meta.md5 = data_to_process.AP_data.dataVer;
                img_meta.size = data_to_process.AP_data.dataSize;
                img_meta.image_format = data_to_process.AP_data.dataType;
                img_meta.image_type = CUSTOM_IMAGE_NOCUSTOM;
                oepl_nvm_write_image_metadata(img_idx, &img_meta);
                application_state_transition(DOWNLOAD);
              } else {
                PINPROV_DBG("H-C", "cache_hit skip_download -> AWAITING_CONFIRMATION");
                DPRINTF("We have this one in cache...\n");
                application_state_transition(AWAITING_CONFIRMATION);
              }
            } else {
              // Something happened to the download of this image... erase and retry in the same slot
              oepl_nvm_erase_image(img_idx);
              img_meta.is_valid = false;
              img_meta.md5 = data_to_process.AP_data.dataVer;
              img_meta.size = data_to_process.AP_data.dataSize;
              img_meta.image_format = data_to_process.AP_data.dataType;
              img_meta.image_type = IMG_EXTTYPE_IMGID_FROM_EXTTYPE( data_to_process.AP_data.dataTypeArgument );
              oepl_nvm_write_image_metadata(img_idx, &img_meta);
              DPRINTF("Downloading image ID 0x%x in slot 0x%x\n", img_meta.image_type, img_idx);
              application_state_transition(DOWNLOAD);
            }
          } else {
            uint8_t image_type = CUSTOM_IMAGE_NOCUSTOM;
            if(oepl_provision_is_session_authorized() || oepl_provision_is_active()) {
              PINPROV_DBG("H-C", "provision_slot_alloc");
              nvm_status = oepl_app_allocate_provision_slot(&img_idx);
            } else {
              nvm_status = oepl_nvm_get_free_image_slot(&img_idx, image_type);
              if(nvm_status != NVM_SUCCESS) {
                // Out of slots for holding persistent images. Remove cached images (without removing most recent one) to try and alleviate.
                nvm_status = oepl_nvm_erase_image_cache(CUSTOM_IMAGE_NOCUSTOM);
                nvm_status = oepl_nvm_erase_image_cache(CUSTOM_IMAGE_SLIDESHOW);
                nvm_status = oepl_nvm_get_free_image_slot(&img_idx, image_type);
              }
            }
            if(nvm_status == NVM_SUCCESS) {
              oepl_stored_image_hdr_t img_meta;
              bool provision_xfer = oepl_provision_is_session_authorized() || oepl_provision_is_active();
              img_meta.is_valid = false;
              img_meta.md5 = data_to_process.AP_data.dataVer;
              img_meta.size = data_to_process.AP_data.dataSize;
              img_meta.image_format = data_to_process.AP_data.dataType;
              img_meta.image_type = provision_xfer
                  ? CUSTOM_IMAGE_NOCUSTOM
                  : IMG_EXTTYPE_IMGID_FROM_EXTTYPE(data_to_process.AP_data.dataTypeArgument);
              oepl_nvm_write_image_metadata(img_idx, &img_meta);
              DPRINTF("Downloading image ID 0x%x in slot 0x%x\n", img_meta.image_type, img_idx);
              application_state_transition(DOWNLOAD);
            } else {
              DPRINTF("We don't have space for this...\n");
              if(oepl_provision_is_session_authorized() || oepl_provision_is_active()) {
                DPRINTF("Provision: skip XFC without slot, retry on next poll\n");
                application_state_transition(CONNECTED);
              } else {
                application_state_transition(AWAITING_CONFIRMATION);
              }
            }
          }
          break;
        }
        /*case DATATYPE_FW_UPDATE:
        {
          DPRINTF("FWU indicated\n");
          DPRINTF("  - Size %ldB\n", data_to_process.AP_data.dataSize);
          DPRINTF("  - Checksum %08lx%08lx\n", (uint32_t)(data_to_process.AP_data.dataVer >> 32), (uint32_t)data_to_process.AP_data.dataVer);
          // Dup-check before downloading
          if(oepl_fwu_should_download(data_to_process.AP_data.dataVer, (size_t)data_to_process.AP_data.dataSize)) {
            application_state_transition(DOWNLOAD);
          } else {
            DPRINTF("Rejecting upgrade since we're already running this file\n");
            application_state_transition(AWAITING_CONFIRMATION);
          }
          break;
        }*/
        case DATATYPE_NFC_URL_DIRECT:
          // Fallthrough
        case DATATYPE_NFC_RAW_CONTENT:
        {
          DPRINTF("NFC %s indicated\n", data_to_process.AP_data.dataType == DATATYPE_NFC_URL_DIRECT ? "URL" : "raw");
          oepl_stored_content_version_t stored_ver;
          oepl_nvm_status_t status = oepl_nvm_setting_get(OEPL_NFC_CONTENT_VERSION, &stored_ver, sizeof(stored_ver));
          if(status == NVM_SUCCESS) {
            if(data_to_process.AP_data.dataVer == stored_ver.md5 && data_to_process.AP_data.dataSize == stored_ver.size) {
              DPRINTF("We already have this content in the NFC\n");
              application_state_transition(AWAITING_CONFIRMATION);
            }
          } else {
            application_state_transition(DOWNLOAD);
          }
          break;
        }
        case DATATYPE_TAG_CONFIG_DATA:
        {
          DPRINTF("Tag settings update indicated\n");
          oepl_stored_content_version_t stored_ver;
          oepl_nvm_status_t status = oepl_nvm_setting_get(OEPL_SETTINGS_CONTENT_VERSION, &stored_ver, sizeof(stored_ver));
          if(status == NVM_SUCCESS) {
            if(data_to_process.AP_data.dataVer == stored_ver.md5 && data_to_process.AP_data.dataSize == stored_ver.size) {
              DPRINTF("We already have these settings\n");
              application_state_transition(AWAITING_CONFIRMATION);
            }
          } else {
            application_state_transition(DOWNLOAD);
          }
          break;
        }
        case DATATYPE_COMMAND_DATA:
        {
          DPRINTF("Command 0x%02X received\n", data_to_process.AP_data.dataTypeArgument);
          // ACK it first thing we do, as we might be resetting the tag
          application_state_transition(AWAITING_CONFIRMATION);
          break;
        }
        default:
          DPRINTF("Unsupported datatype indicated\n");
          application_state_transition(CONNECTED);
          break;
      }
      break;
    case AWAITING_CONFIRMATION:
      // Nothing to see here, awaiting a radio state transition which can
      // make us act.
      break;
    case CONFIRMATION_RECEIVED:
      // If this was a command which got postponed, act on it now
      if(data_to_process.AP_data.dataType == DATATYPE_COMMAND_DATA) {
        switch(data_to_process.AP_data.dataTypeArgument) {
          /*case CMD_DO_REBOOT:
            DPRINTF("Rebooting\n");
            oepl_hw_reboot();
            break;*/
          case CMD_DO_SCAN:
            DPRINTF("Forced scan (roam) triggered\n");
            oepl_radio_try_roam();
            break;
          /*case CMD_DO_RESET_SETTINGS:
            oepl_nvm_setting_set_default(OEPL_RAW_TAGSETTINGS);
            DPRINTF("Reset settings, rebooting...\n");
            oepl_hw_reboot();
            break;*/
          case CMD_DO_DEEPSLEEP:
            DPRINTF("Enter deepsleep\n");
            DPRINTF("To wake, press a button or power cycle\n");
            oepl_display_show_infoscreen(INFOSCREEN_DEEPSLEEP);
            oepl_hw_enter_deepsleep();
            break;
          /*case CMD_DO_LEDFLASH:
          {
            uint8_t led_data[12];
            led_data[0] = (data_to_process.AP_data.dataVer >>  0) & 0xFF;
            led_data[1] = (data_to_process.AP_data.dataVer >>  8) & 0xFF;
            led_data[2] = (data_to_process.AP_data.dataVer >> 16) & 0xFF;
            led_data[3] = (data_to_process.AP_data.dataVer >> 24) & 0xFF;
            led_data[4] = (data_to_process.AP_data.dataVer >> 32) & 0xFF;
            led_data[5] = (data_to_process.AP_data.dataVer >> 40) & 0xFF;
            led_data[6] = (data_to_process.AP_data.dataVer >> 48) & 0xFF;
            led_data[7] = (data_to_process.AP_data.dataVer >> 56) & 0xFF;
            led_data[8] = (data_to_process.AP_data.dataSize >>  0) & 0xFF;
            led_data[9] = (data_to_process.AP_data.dataSize >>  8) & 0xFF;
            led_data[10] = (data_to_process.AP_data.dataSize >> 16) & 0xFF;
            led_data[11] = (data_to_process.AP_data.dataSize >> 24) & 0xFF;
            if(oepl_led_flash_sequence(led_data)) {
              DPRINTF("LED sequence executing\n");
            } else {
              DPRINTF("LED sequence canceled since previous still in progress\n");
            }
            break;
          }
          case CMD_ERASE_EEPROM_IMAGES:
          {
            DPRINTF("Erase all stored images (and LUTs?)\n");
            size_t num_img, img_size;
            oepl_nvm_status_t nvm_status = oepl_nvm_get_num_img_slots(&num_img, &img_size);
            if(nvm_status == NVM_SUCCESS) {
              for(size_t i = 0; i < num_img; i++) {
                oepl_nvm_erase_image(i);
              }
            }
            break;
          }*/
          case CMD_ENTER_SLIDESHOW_FAST:
            DPRINTF("Enter fast slideshow mode\n");
            application_mode_transition(MODE_SLIDESHOW_FAST);
            break;
          case CMD_ENTER_SLIDESHOW_MEDIUM:
            DPRINTF("Enter medium slideshow mode\n");
            application_mode_transition(MODE_SLIDESHOW_MEDIUM);
            break;
          case CMD_ENTER_SLIDESHOW_SLOW:
            DPRINTF("Enter slow slideshow mode\n");
            application_mode_transition(MODE_SLIDESHOW_SLOW);
            break;
          case CMD_ENTER_SLIDESHOW_GLACIAL:
            DPRINTF("Enter glacial slideshow mode\n");
            application_mode_transition(MODE_SLIDESHOW_GLACIAL);
            break;
          case CMD_ENTER_NORMAL_MODE:
            DPRINTF("Enter normal (AP-directed) mode\n");
            application_mode_transition(MODE_NORMAL);
            break;
          case CMD_ENTER_WAIT_RFWAKE:
            DPRINTF("Enter deepsleep and wait for RF wake signal\n");
            application_mode_transition(MODE_WAIT_RFWAKE);
            break;
          case CMD_GET_BATTERY_VOLTAGE:
          {
            DPRINTF("Forced battery voltage measurement and trigger a poll\n");
            uint16_t voltage;
            oepl_hw_get_voltage(&voltage, true);
            oepl_radio_send_poll_with_reason(WAKEUP_REASON_TIMED);
            break;
          }
          case CMD_PROVISION_COMPLETE:
          {
            bool unlock_updates = (data_to_process.AP_data.dataVer & 0xFFU) != 0U;
            if(oepl_provision_is_provisioned()) {
              DPRINTF("Ignoring duplicate provision-complete\n");
              break;
            }
            if(oepl_provision_has_stored_image()) {
              oepl_provision_mark_provisioned(unlock_updates);
              oepl_provision_show_user_image();
            } else {
              PINPROV_DBG("H-C", "provision_complete REJECT no image");
              DPRINTF("Ignoring provision-complete without stored image\n");
              oepl_provision_show_user_image();
            }
            break;
          }
          case CMD_ENTER_PROVISION_MODE:
            oepl_provision_begin_pin_display();
            break;
          default:
            DPRINTF("Unknown CMD 0x%02x\n", data_to_process.AP_data.dataTypeArgument);
            break;
        }
      } else if(data_to_process.AP_data.dataType == DATATYPE_FW_UPDATE) {
        size_t highest_block;
        oepl_nvm_status_t status = oepl_fwu_get_highest_block_written(&highest_block);
        if(status == NVM_SUCCESS) {
          size_t file_blocks = data_to_process.AP_data.dataSize / 4096;
          if(file_blocks % 4096) {
            file_blocks++;
          }

          if(highest_block >= file_blocks - 1) {
            status = oepl_fwu_check();
            if(status == NVM_ERROR) {
              DPRINTF("Couldn't validate firmware, signaling failure\n");
              oepl_radio_send_poll_with_reason(WAKEUP_REASON_FAILED_OTA_FW);
              oepl_fwu_erase();
            } else {
              DPRINTF("Applying upgrade...\n");
              oepl_display_show_infoscreen(INFOSCREEN_FWU);
              oepl_fwu_apply();
              oepl_hw_crash(DBG_APP, true, "Failed to apply FWU\n");
            }
          } else {
            DPRINTF("Don't have all FWU blocks, signaling failure\n");
            oepl_radio_send_poll_with_reason(WAKEUP_REASON_FAILED_OTA_FW);
          }
        } else {
          DPRINTF("HW failure, signaling failure\n");
          oepl_radio_send_poll_with_reason(WAKEUP_REASON_FAILED_OTA_FW);
        }
      } else if(data_to_process.AP_data.dataType == DATATYPE_IMG_RAW_1BPP ||
                data_to_process.AP_data.dataType == DATATYPE_IMG_RAW_2BPP ||
                data_to_process.AP_data.dataType == DATATYPE_IMG_ZLIB) {
        // If the AP requested us to show this image on screen, do it now.
        if((data_to_process.AP_data.dataTypeArgument & IMG_EXTTYPE_PRELOAD_FLAG) == 0) {
          oepl_stored_image_hdr_t img_meta;
          size_t img_idx;
          oepl_nvm_status_t nvm_status = oepl_nvm_get_image_by_hash(
            data_to_process.AP_data.dataVer, data_to_process.AP_data.dataSize,
            &img_idx, &img_meta);
          
