abagofbread/defcon-34-eink-tags/Tag_FW_EFR32xG22/firmware/oepl_app.c
          if(nvm_status == NVM_SUCCESS && img_meta.is_valid) {
            // #region agent log
            if (oepl_provision_is_active()) {
              PINPROV_DBG("H2", "DBG1AC9CA show_image OVERWRITE_PIN slot=%u",
                          (unsigned)img_idx);
            }
            // #endregion
            PINPROV_DBG("H-C", "show_image slot=%u", (unsigned)img_idx);
            DPRINTF("Showing image\n");
            oepl_display_show_image(img_idx);
          } else if(oepl_provision_is_session_authorized() || oepl_provision_is_active()) {
            // #region agent log
            PINPROV_DBG("H2", "DBG1AC9CA show_image FALLBACK_WHILE_PIN auth=%d active=%d",
                        (int)oepl_provision_is_session_authorized(),
                        (int)oepl_provision_is_active());
            // #endregion
            PINPROV_DBG("H-C", "show_image fallback provision slot");
            oepl_provision_show_user_image();
          } else {
            PINPROV_DBG("H-C", "show_image FAIL nvm=%d valid=%d", (int)nvm_status, img_meta.is_valid);
            DPRINTF("Confirmed image but couldn't find it in storage. MD5 mismatch or out of space?\n");
          }
        }
        // If the new image we received is not a multi-instance image, remove
        // all previous versions from storage.
        switch(IMG_EXTTYPE_IMGID_FROM_EXTTYPE( data_to_process.AP_data.dataTypeArgument )) {
          case CUSTOM_IMAGE_NOCUSTOM:
            break;
          case CUSTOM_IMAGE_SLIDESHOW:
            break;
          default:
            oepl_nvm_erase_image_cache(IMG_EXTTYPE_IMGID_FROM_EXTTYPE( data_to_process.AP_data.dataTypeArgument ));
            break;
        }
      } else if(data_to_process.AP_data.dataType == DATATYPE_TAG_CONFIG_DATA) {
        // We might have changed modes
        uint8_t new_mode;
        oepl_nvm_setting_get(OEPL_CUSTOM_MODE, &new_mode, sizeof(new_mode));
        application_mode_transition(new_mode);
      }
      application_state_transition(CONNECTED);
      break;
    case DOWNLOAD:
      if(datablock != NULL)
      {
        size_t blocks_in_file = data_to_process.AP_data.dataSize / 4096;
        if(data_to_process.AP_data.dataSize % 4096 != 0) {
          blocks_in_file += 1;
        }
        bool is_last_block = datablock_in_progress.idx == blocks_in_file - 1;
        size_t block_size = is_last_block ? data_to_process.AP_data.dataSize % 4096 : 4096;

        // Which process was this data intended for?
        bool proceed = true;
        switch(data_to_process.AP_data.dataType) {
          case DATATYPE_IMG_RAW_1BPP:
          case DATATYPE_IMG_RAW_2BPP:
          case DATATYPE_IMG_ZLIB:
            DPRINTF("Received %simage block %d\n", is_last_block? "last ": "", datablock_in_progress.idx);
            proceed = application_process_image_block(datablock_in_progress.idx, datablock, block_size, is_last_block);
            break;
          case DATATYPE_FW_UPDATE:
            DPRINTF("Received %sFWU block %d\n", is_last_block? "last ": "", datablock_in_progress.idx);
            proceed = application_process_fwu_block(datablock_in_progress.idx, datablock, block_size, is_last_block);
            break;
          case DATATYPE_TAG_CONFIG_DATA:
            DPRINTF("Received %stag config block %d\n", is_last_block? "last ": "", datablock_in_progress.idx);
            proceed = application_process_config_block(datablock_in_progress.idx, datablock, block_size, is_last_block);
            break;
          case DATATYPE_NFC_URL_DIRECT:
            DPRINTF("Received %sNFC URL block %d\n", is_last_block? "last ": "", datablock_in_progress.idx);
            proceed = application_process_nfcu_block(datablock_in_progress.idx, datablock, block_size, is_last_block);
            break;
          case DATATYPE_NFC_RAW_CONTENT:
            DPRINTF("Received %sNFC raw block %d\n", is_last_block? "last ": "", datablock_in_progress.idx);
            proceed = application_process_nfcr_block(datablock_in_progress.idx, datablock, block_size, is_last_block);
            break;
          default:
            DPRINTF("\n\nERR: received block for unknown datatype\n\n");
            oepl_hw_reboot();
        }

        oepl_radio_release_datablock();

        if(!is_last_block && proceed) {
          datablock_in_progress.idx += 1;
          datablock = NULL;
          oepl_radio_request_datablock(datablock_in_progress);
        } else {
          application_state_transition(AWAITING_CONFIRMATION);
        }
        break;
      }
    case DISCONNECTED:
      // Nothing to see here, waiting for the radio process to tell us we're
      // reconnected.
      break;
  }

  // Handle events which may have happened asynchronously
  if(event_flags != 0) {
    if(event_flags & EVENT_FLAG_BUTTON_1) {
      DPRINTF("Button handler for btn 1\n");
      if (button1_event == FALLING) {
        oepl_button_notify_press(BUTTON_1);
      } else {
        oepl_button_notify_release(BUTTON_1);
        if(current_state == CONNECTED && !oepl_provision_is_active()) {
          oepl_display_show_infoscreen(INFOSCREEN_WAKEUP_BUTTON1);
        }
        oepl_radio_send_poll_with_reason(WAKEUP_REASON_BUTTON1);
      }
      event_flags &= ~EVENT_FLAG_BUTTON_1;
    }
    if(event_flags & EVENT_FLAG_BUTTON_2) {
      DPRINTF("Button handler for btn 2\n");
      if (button2_event == FALLING) {
        oepl_button_notify_press(BUTTON_2);
      } else {
        oepl_button_notify_release(BUTTON_2);
        if(current_state == CONNECTED && !oepl_provision_is_active()) {
          oepl_display_show_infoscreen(INFOSCREEN_WAKEUP_BUTTON2);
        }
        oepl_radio_send_poll_with_reason(WAKEUP_REASON_BUTTON2);
      }
      event_flags &= ~EVENT_FLAG_BUTTON_2;
    }
    if(event_flags & EVENT_FLAG_GPIO) {
      DPRINTF("Button handler for generic GPIO\n");
      oepl_radio_send_poll_with_reason(WAKEUP_REASON_GPIO);
      if(current_state == CONNECTED) {
        oepl_display_show_infoscreen(INFOSCREEN_WAKEUP_GPIO);
      }
      event_flags &= ~EVENT_FLAG_GPIO;
    }
    if(event_flags & EVENT_FLAG_NFC_WAKE) {
      if(!oepl_provision_has_stored_image()) {
        DPRINTF("Button handler for NFC wake pin\n");
        oepl_radio_send_poll_with_reason(WAKEUP_REASON_NFC);
        if(current_state == CONNECTED && !oepl_provision_is_active()) {
          oepl_display_show_infoscreen(INFOSCREEN_WAKEUP_NFC);
        }
      }
      event_flags &= ~EVENT_FLAG_NFC_WAKE;
    }
    if(event_flags & EVENT_FLAG_CONNECTED) {
      DPRINTF("Event handler for association succeeded\n");
      oepl_display_set_overlay(ICON_NOT_CONNECTED, false);
      oepl_provision_on_radio_connected();
      oepl_display_draw(NULL);
      event_flags &= ~EVENT_FLAG_CONNECTED;
    }
    if(event_flags & EVENT_FLAG_DISCONNECTED) {
      DPRINTF("Event handler for becoming an orphan\n");
      oepl_display_set_overlay(ICON_NOT_CONNECTED, true);
      oepl_provision_on_radio_disconnected();
      oepl_display_draw(NULL);
      event_flags &= ~EVENT_FLAG_DISCONNECTED;
    }
  }
}

