abagofbread/defcon-34-eink-tags/Tag_FW_EFR32xG22/firmware/oepl_app.c
// -----------------------------------------------------------------------------
//                          Static Function Definitions
// -----------------------------------------------------------------------------
static oepl_radio_action_t radio_event_handler(oepl_radio_event_t event, const void* event_data)
{
  switch(event) {
    case ASSOCIATED:
    {
      DPRINTF("Associated on channel %ld!\n", (uint32_t)event_data);
      uint32_t prev_ch;
      oepl_nvm_setting_get(OEPL_LAST_CONNECTED_CHANNEL, &prev_ch, sizeof(uint32_t));
      if(prev_ch != (uint32_t)event_data) {
        oepl_nvm_setting_set(OEPL_LAST_CONNECTED_CHANNEL, &event_data, sizeof(uint32_t));
      }
      application_state_transition(CONNECTED);
      break;
    }
    case ORPHANED:
      DPRINTF("Orphaned!\n");
      application_state_transition(DISCONNECTED);
      break;
    case AP_DATA:      
      DPRINTF("Data pending!\n");
      application_process_data((oepl_radio_data_indication_t*) event_data);
      break;
    case BLOCK_COMPLETE:
      DPRINTF("Block received!\n");
      application_process_datablock((oepl_radio_blockrecv_t*) event_data);
      break;
    case BLOCK_TIMEOUT:
      DPRINTF("Block timed out\n");
      // Since retries are already built into the radio logic, we have to
      // assume this download transaction is lost.

      // Go back to connected, we'll orphan after a couple more check-ins
      // have failed.
      application_state_transition(CONNECTED);
      break;
    case BLOCK_CANCELED:
      DPRINTF("AP canceled transfer\n");
      //Todo: How to handle this? Erase the in-flight storage and forget
      // that this data transfer ever existed?
      application_state_transition(CONNECTED);
      break;
    case SCAN_TIMEOUT:
      DPRINTF("Scan timeout!\n");
      if(current_state == BOOT) {
        application_state_transition(DISCONNECTED);
      } else if(current_state != DISCONNECTED) {
        DPRINTF("Scan timeout while connected - we'll get orphaned if this continues\n");
      }
      break;
    case CHANNEL_ROAM:
    {
      DPRINTF("Switched channel to %ld!\n", (uint32_t) event_data);
      // This doesn't impact the application at all, but we update the stored
      // channel number for fast-associate after reboot
      uint32_t prev_ch;
      oepl_nvm_setting_get(OEPL_LAST_CONNECTED_CHANNEL, &prev_ch, sizeof(uint32_t));
      if(prev_ch != (uint32_t) event_data) {
        oepl_nvm_setting_set(OEPL_LAST_CONNECTED_CHANNEL, &event_data, sizeof(uint32_t));
      }
      break;
    }
    case POLL_TIMEOUT:
      DPRINTF("Timed out on a poll - radio process should take care of it\n");
      break;
    case CONFIRMATION_COMPLETE:
      DPRINTF("Received confirmation ACK\n");
      application_state_transition(CONFIRMATION_RECEIVED);
      break;
    case CONFIRMATION_TIMEOUT:
      // Treat a timeout on ACK'ing the confirmation the same as receiving
      // the confirmation. We'll possibly get the same data notification if
      // the confirmation really didn't come through, but dup checking should
      // avoid us from getting stuck in a loop of downloading and not being
      // able to confirm.
      DPRINTF("Did not receive confirmation ACK\n");
      application_state_transition(CONFIRMATION_RECEIVED);
      break;
  }
  return NO_ACTION;
}

static void application_state_transition(application_state_t new_state)
{
  // same-state transition should be invalid...
  if(new_state == current_state) {
    DPRINTF("\n\nERR: Same state transition not allowed\n\n");
    oepl_hw_reboot();
    return;
  }

  // Perform housekeeping on state transition
  switch(new_state) {
    case CONNECTED:
      if(current_state == DISCONNECTED ||
         current_state == BOOT) {
        // Tell the event loop to redraw the EPD when changing from disconnected to connected
        event_flags |= EVENT_FLAG_CONNECTED;
      }
      break;
    case DISCONNECTED:
      if(current_state == CONNECTED ||
         current_state == BOOT) {
        // Tell the event loop to redraw the EPD when changing from connected to disconnected
        event_flags |= EVENT_FLAG_DISCONNECTED;
      }
      break;
    case AWAITING_CONFIRMATION:
      // Progressing to awaiting a confirmation always starts with sending a confirmation
      oepl_radio_acknowledge_action(data_to_process.AP_MAC, data_to_process.AP_PAN);
      break;
    case DOWNLOAD:
      if(current_state != DATA_AVAILABLE) {
        DPRINTF("\n\nERR: Invalid state transition: download without being told to\n\n");
        oepl_hw_reboot();
      }
      // Progressing to download state means resetting the download logic
      DPRINTF("Starting download of %ld bytes\n", data_to_process.AP_data.dataSize);
      datablock_in_progress.file.type = data_to_process.AP_data.dataType;
      memcpy(&datablock_in_progress.file.id, &data_to_process.AP_data.dataVer, sizeof(uint64_t));
      memcpy(datablock_in_progress.file.ap, data_to_process.AP_MAC, sizeof(datablock_in_progress.file.ap));
      datablock_in_progress.file.ap_pan = data_to_process.AP_PAN;
      datablock_in_progress.file.filesize = data_to_process.AP_data.dataSize;

      // Check for partial resume support
      switch(data_to_process.AP_data.dataType) {
        case DATATYPE_FW_UPDATE:
        {
          uint64_t staged_md5;
          size_t staged_size;
          uint16_t staged_version;
          oepl_nvm_status_t status = oepl_fwu_get_metadata(&staged_version, &staged_md5, &staged_size);
          if(status == NVM_NOT_FOUND) {
            status = oepl_fwu_set_metadata(0xFFFF, data_to_process.AP_data.dataVer, data_to_process.AP_data.dataSize);
            if(status == NVM_SUCCESS) {
              DPRINTF("Starting FWU from scratch\n");
              datablock_in_progress.idx = 0;
            } else {
              // we can't do this right now.
              DPRINTF("Failed to set upgrade meta\n");
              oepl_radio_acknowledge_action(data_to_process.AP_MAC, data_to_process.AP_PAN);
              new_state = AWAITING_CONFIRMATION;
            }
          } else if(status == NVM_ERROR) {
            // we can't do this right now.
            DPRINTF("FWU internal error, can't start\n");
            oepl_radio_acknowledge_action(data_to_process.AP_MAC, data_to_process.AP_PAN);
            new_state = AWAITING_CONFIRMATION;
          } else {
            if(staged_size == data_to_process.AP_data.dataSize && staged_md5 == data_to_process.AP_data.dataVer) {
              status = oepl_fwu_get_highest_block_written(&datablock_in_progress.idx);
              if(status != NVM_SUCCESS) {
                DPRINTF("Starting FWU, unsure about the blocks written\n");
                datablock_in_progress.idx = 0;
              } else if(datablock_in_progress.idx == 0) {
                // Didn't get further than the first block or didn't start writing at all.
                DPRINTF("Restarting FWU\n");
              } else {
                size_t blocks_in_file = staged_size / 4096;
                if(staged_size % 4096) {
                  blocks_in_file++;
                }
                if(datablock_in_progress.idx >= blocks_in_file - 1) {
                  // Our previous process succeeded, go to confirmation and retrigger upgrade
                  DPRINTF("Already received this file fully\n");
                  oepl_radio_acknowledge_action(data_to_process.AP_MAC, data_to_process.AP_PAN);
                  new_state = AWAITING_CONFIRMATION;
                } else {
                  // Continue with the next block
                  datablock_in_progress.idx++;
                  DPRINTF("Resuming FWU at block %d\n", datablock_in_progress.idx);
                }
              }
            } else {
              // Receiving a different file, need to start anew
              status = oepl_fwu_set_metadata(0xFFFF, data_to_process.AP_data.dataVer, data_to_process.AP_data.dataSize);
              if(status == NVM_SUCCESS) {
                DPRINTF("Reset FWU metadata to receive new upgrade file\n");
                datablock_in_progress.idx = 0;
              } else {
                // we can't do this right now.
                DPRINTF("Couldn't reset metadata\n");
                oepl_radio_acknowledge_action(data_to_process.AP_MAC, data_to_process.AP_PAN);
                new_state = AWAITING_CONFIRMATION;
              }
            }
          }
          break;
        }
        default:
          datablock_in_progress.idx = 0;
          break;
      }

      // Start the download if we still want to proceed
      if(new_state == DOWNLOAD) {
        datablock = NULL;
        oepl_radio_request_datablock(datablock_in_progress);
      }
      break;
    default:
      break;
  }
  if (new_state == DOWNLOAD || new_state == AWAITING_CONFIRMATION ||
      new_state == DATA_AVAILABLE || new_state == CONFIRMATION_RECEIVED) {
    PINPROV_DBG("H-A", "state %d -> %d", current_state, new_state);
  }
  current_state = new_state;
}

static oepl_nvm_status_t oepl_app_allocate_provision_slot(size_t* img_idx)
{
  size_t num_slots, slot_size;
  oepl_nvm_status_t st = oepl_nvm_get_num_img_slots(&num_slots, &slot_size);
  if(st != NVM_SUCCESS) {
    DPRINTF("Provision: slot count unavailable (bulk storage missing)\n");
    return st;
  }
  if(OEPL_PROVISION_BULK_SLOT >= num_slots) {
    DPRINTF("Provision: bulk slot %u unavailable (have %u slots)\n",
            (unsigned)OEPL_PROVISION_BULK_SLOT, (unsigned)num_slots);
    return NVM_NOT_SUPPORTED;
  }

