abagofbread/defcon-34-eink-tags/Tag_FW_EFR32xG22/firmware/oepl_app.c
  oepl_nvm_log_image_slots();

  size_t old_idx;
  if(oepl_nvm_get_image_by_type(CUSTOM_IMAGE_NOCUSTOM, &old_idx, NULL) == NVM_SUCCESS &&
     old_idx != OEPL_PROVISION_BULK_SLOT) {
    DPRINTF("Provision: clearing stale NOCUSTOM in slot %u\n", (unsigned)old_idx);
    oepl_nvm_erase_image(old_idx);
  }

  *img_idx = OEPL_PROVISION_BULK_SLOT;
  PINPROV_DBG("H-C", "provision_force slot=%u type=0x00", (unsigned)OEPL_PROVISION_BULK_SLOT);
  DPRINTF("Provision: erase+reuse physical slot %u (NOCUSTOM)\n", (unsigned)OEPL_PROVISION_BULK_SLOT);
  return oepl_nvm_erase_image(OEPL_PROVISION_BULK_SLOT);
}

static bool application_is_locked_update(uint8_t dataType)
{
  if (oepl_provision_is_session_authorized()) {
    return !oepl_provision_accepts_content_type(dataType);
  }

  if (oepl_provision_updates_allowed()) {
    return false;
  }

  switch(dataType) {
    case DATATYPE_IMG_RAW_1BPP:
    case DATATYPE_IMG_RAW_2BPP:
    case DATATYPE_IMG_ZLIB:
    case DATATYPE_NOUPDATE:
    case DATATYPE_COMMAND_DATA:
      return false;
    default:
      return true;
  }
}

static void application_process_data(oepl_radio_data_indication_t* data)
{
  // Process it in the main loop to not make our stack depth go bonkers
  if(current_state == CONNECTED || current_state == BOOT || current_state == DISCONNECTED) {
    memcpy(&data_to_process, data, sizeof(*data));
    application_state_transition(DATA_AVAILABLE);
  } else if(current_state == DOWNLOAD ||
            current_state == AWAITING_CONFIRMATION ||
            current_state == CONFIRMATION_RECEIVED) {
    // C6 re-offers pending AvailDataInfo on every poll while attemptsLeft>0.
    // Ignore duplicates during an active transfer instead of rebooting.
    PINPROV_DBG("H-E", "dup_offer ignored state=%d", current_state);
    DPRINTF("Ignoring duplicate data indication during xfer (state %d)\n", current_state);
  } else {
    // We received a poll response while still processing the previous 
    // one or while not in a connected state. If we really have been awake
    // for at least 40 seconds, something must be wrong.
    // Treat this as an invalid transition and reset the system.
    DPRINTF("\n\nERR: Data indication received while still handling previous data indication\n\n");
    oepl_hw_reboot();
  }
}

static void application_process_datablock(oepl_radio_blockrecv_t* block)
{
  // Called from the radio callback, so we'll have at least one round in the application
  // event loop after this.
  if(current_state != DOWNLOAD) {
    DPRINTF("\n\nERR: received datablock but not in download state\n\n");
    oepl_hw_reboot();
  }

  if(block->block_index != datablock_in_progress.idx) {
    DPRINTF("\n\nERR: received out-of-order datablock\n\n");
    oepl_hw_reboot();
  }

  if(datablock != NULL) {
    DPRINTF("\n\nERR: not finished with the previous datablock\n\n");
    oepl_hw_reboot();
  }

  datablock = block->block_data;
}

static bool application_process_image_block(size_t index, const uint8_t* data, size_t length, bool is_last)
{
  oepl_stored_image_hdr_t img_meta;
  size_t img_idx;
  oepl_nvm_status_t nvm_status = oepl_nvm_get_image_by_hash(
    data_to_process.AP_data.dataVer, data_to_process.AP_data.dataSize,
    &img_idx, &img_meta);
  if(nvm_status == NVM_SUCCESS) {
    nvm_status = oepl_nvm_write_image_bytes(img_idx, index * 4096, data, length);
  } else {
    DPRINTF("App error: couldn't get image metadata for download in progress\n");
    return false;
  }

  if(nvm_status != NVM_SUCCESS) {
    DPRINTF("Couldn't write image bytes into slot, erasing full slot\n");
    oepl_nvm_erase_image(img_idx);
    return false;
  }

  if(is_last) {
    MD5Context md5;
    md5Init(&md5);

    size_t img_blocks = img_meta.size / 4096;
    if(img_meta.size % 4096) {
      img_blocks++;
    }

    for(size_t i = 0; i < img_blocks; i++) {
      size_t this_block_size = i == img_blocks - 1 ? img_meta.size % 4096 : 4096;
      //Todo: do something about this cast?
      // -> We know we're using the radio buffer here which is mutable...
      memset(data, 0x12, this_block_size);
      nvm_status = oepl_nvm_read_image_bytes(img_idx, i*4096, (uint8_t*)data, this_block_size);
      if(nvm_status != NVM_SUCCESS) {
        DPRINTF("Error reading image data from NVM\n");
        return false;
      }
      DPRINTF("Feeding MD5 %d bytes\n", this_block_size);
      md5Update(&md5, data, this_block_size);
    }
    md5Finalize(&md5);
    if(memcmp(&md5.digest[0], &img_meta.md5, sizeof(img_meta.md5)) == 0) {
      // Mark image download as valid
      DPRINTF("Image MD5 checks out\nMaking image of type 0x%x in slot 0x%x valid\n", img_meta.image_type, img_idx);
      img_meta.is_valid = true;
      nvm_status = oepl_nvm_write_image_metadata(img_idx, &img_meta);
      if(nvm_status != NVM_SUCCESS) {
        DPRINTF("Error making image valid\n");
      } else if(oepl_provision_is_session_authorized() || oepl_provision_is_active() ||
                img_idx == OEPL_PROVISION_BULK_SLOT) {
        oepl_provision_on_image_downloaded(img_idx);
      } else {
        oepl_display_show_image(img_idx);
      }
      return false;
    } else {
      // Erase image download
      DPRINTF("MD5 mismatch on image download, erasing\n");
      nvm_status = oepl_nvm_erase_image(img_idx);
      if(nvm_status != NVM_SUCCESS) {
        DPRINTF("Error erasing image\n");
      }
      return false;
    }
  } else {
    return true;
  }
}

static bool application_process_fwu_block(size_t index, const uint8_t* data, size_t length, bool is_last)
{
  (void) is_last;
  oepl_nvm_status_t status = oepl_fwu_write(index, data, length);
  if(status != NVM_SUCCESS) {
    // We can't proceed right now...
    return false;
  }

  return true;
}

static bool application_check_md5(const uint8_t* data, size_t bytes, const uint8_t* reference)
{
  MD5Context md5;
  md5Init(&md5);
  md5Update(&md5, data, bytes);
  md5Finalize(&md5);
  if(memcmp(&md5.digest[0], reference, 8) == 0) {
    return true;
  } else {
    DPRINTF("MD5 mismatch on %ld bytes:\n", bytes);
    DPRINTF("- Expected: %02X%02X%02X%02X%02X%02X%02X%02X\n", reference[0], reference[1], reference[2], reference[3],
                                                              reference[4], reference[5], reference[6], reference[7]);
    DPRINTF("- Computed: %02X%02X%02X%02X%02X%02X%02X%02X\n", md5.digest[0], md5.digest[1], md5.digest[2], md5.digest[3],
                                                              md5.digest[4], md5.digest[5], md5.digest[6], md5.digest[7]);
    DPRINTF("- Data:\n\t");
    for(size_t i = 0; i < bytes; i++) {
      DPRINTF("%02X", data[i]);
      if(i % 16 == 0 && i != 0) {
        DPRINTF("\n\t");
      }
    }
    DPRINTF("\n");
    return false;
  }
}

static bool application_process_config_block(size_t index, const uint8_t* data, size_t length, bool is_last)
{
  if(index == 0 && is_last) {
    if(length != sizeof(struct tagsettings)) {
      DPRINTF("Don't know how to parse these settings, size mismatch\n");
    }

    // Check MD5 before storing
    if(!application_check_md5(data, length, (const uint8_t*)&data_to_process.AP_data.dataVer)) {
      DPRINTF("MD5 mismatch\n");
      return false;
    }

    oepl_nvm_setting_set(OEPL_RAW_TAGSETTINGS, data, sizeof(struct tagsettings));
    oepl_stored_content_version_t stored_ver = {
      .md5 = data_to_process.AP_data.dataVer,
      .size = data_to_process.AP_data.dataSize
    };
    oepl_nvm_setting_set(OEPL_SETTINGS_CONTENT_VERSION, &stored_ver, sizeof(stored_ver));
    return false;
  } else {
    DPRINTF("Usage error: can't support tag settings larger than one block\n");
    return false;
  }
}

static bool application_process_nfcu_block(size_t index, const uint8_t* data, size_t length, bool is_last)
{
  if(index == 0 && is_last) {
    // Check MD5 before storing
    if(!application_check_md5(data, length, (const uint8_t*)&data_to_process.AP_data.dataVer)) {
      DPRINTF("MD5 mismatch\n");
      return false;
    }

    oepl_hw_nfc_write_url(data, length);
    oepl_stored_content_version_t stored_ver = {
      .md5 = data_to_process.AP_data.dataVer,
      .size = data_to_process.AP_data.dataSize
    };
    oepl_nvm_setting_set(OEPL_NFC_CONTENT_VERSION, &stored_ver, sizeof(stored_ver));
    return false;
  } else {
    DPRINTF("Usage error: can't support NFC URLs larger than one block\n");
    return false;
  }
}

static bool application_process_nfcr_block(size_t index, const uint8_t* data, size_t length, bool is_last)
{
  if(index == 0 && is_last) {
    // Check MD5 before storing
    if(!application_check_md5(data, length, (const uint8_t*)&data_to_process.AP_data.dataVer)) {
      DPRINTF("MD5 mismatch\n");
      return false;
    }

    oepl_hw_nfc_write_raw(data, length);
    oepl_stored_content_version_t stored_ver = {
      .md5 = data_to_process.AP_data.dataVer,
      .size = data_to_process.AP_data.dataSize
    };
    oepl_nvm_setting_set(OEPL_NFC_CONTENT_VERSION, &stored_ver, sizeof(stored_ver));
    return false;
  } else {
    DPRINTF("Usage error: can't support NFC data content larger than one block\n");
    return false;
  }
}

static void oepl_app_button_handler(oepl_hw_gpio_channel_t button, oepl_hw_gpio_event_t event)
{
  switch(button) {
    case BUTTON_1:
      button1_event = event;
      event_flags |= EVENT_FLAG_BUTTON_1;
      break;
    case BUTTON_2:
      button2_event = event;
      event_flags |= EVENT_FLAG_BUTTON_2;
      break;
    case GENERIC_GPIO:
      event_flags |= EVENT_FLAG_GPIO;
      break;
    case NFC_WAKE:
      event_flags |= EVENT_FLAG_NFC_WAKE;
      break;
  }
}

static void application_mode_transition(application_mode_t new_mode)
{
  // Todo: implement support for running modes / slideshow
  (void) new_mode;
  DPRINTF("Custom modes are not supported yet\n");
}
